In [1]:
import pandas as pd

In [2]:
dict1 = {'Name': ['Priyang Bhatt', 'Rashmin Panchal', 'Anil Rana', 'Rahul Patel'],
        'City': [' New York ', ' Los Angeles ', ' Chicago', ' Houston'],
        'State': ['NY', 'CA', 'IL', 'TX']}
data = pd.DataFrame(dict1)

In [3]:
data

              Name           City State
0    Priyang Bhatt      New York     NY
1  Rashmin Panchal   Los Angeles     CA
2        Anil Rana        Chicago    IL
3      Rahul Patel        Houston    TX

In [5]:
data['name_lower'] = data['Name'].str.lower()

In [7]:
data

              Name           City State       name_lower
0    Priyang Bhatt      New York     NY    priyang bhatt
1  Rashmin Panchal   Los Angeles     CA  rashmin panchal
2        Anil Rana        Chicago    IL        anil rana
3      Rahul Patel        Houston    TX      rahul patel

In [8]:
data['name_upper'] = data['Name'].str.upper()

In [9]:
data

              Name           City State       name_lower       name_upper
0    Priyang Bhatt      New York     NY    priyang bhatt    PRIYANG BHATT
1  Rashmin Panchal   Los Angeles     CA  rashmin panchal  RASHMIN PANCHAL
2        Anil Rana        Chicago    IL        anil rana        ANIL RANA
3      Rahul Patel        Houston    TX      rahul patel      RAHUL PATEL

In [10]:
data['Name'].str.len()

0    13
1    15
2     9
3    11
Name: Name, dtype: int64

In [11]:
data['Nmae_len'] = data['Name'].str.len()

In [12]:
data

,Name,City,State,name_lower,name_upper,Nmae_len
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11

In [14]:
data['City'][0]

' New York '

In [19]:
data['City_strip'] = data['City'].str.strip()

In [18]:
data['City'][0]

' New York '

In [20]:
data['City_strip'][0]

'New York'

In [21]:
data

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston

In [24]:
data[['First_name','Last_name']] = data['Name'].str.split(' ',expand = True)

In [25]:
data

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,Priyang,Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Rashmin,Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Anil,Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Rahul,Patel

In [28]:
data['State_name'] = data['State'].str.replace('NY','New York').replace('CA','California')

In [29]:
data

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name,State_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,Priyang,Bhatt,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Rashmin,Panchal,California
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Anil,Rana,IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Rahul,Patel,TX

In [31]:
data[data['First_name'].str.startswith('P')]

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name,State_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,Priyang,Bhatt,New York

In [32]:
data[data['Last_name'].str.startswith('P')]

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name,State_name
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Rashmin,Panchal,California
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Rahul,Patel,TX

In [33]:
data

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name,State_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,Priyang,Bhatt,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Rashmin,Panchal,California
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Anil,Rana,IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Rahul,Patel,TX

In [35]:
data['Full_name'] = data['First_name'].str.cat(data['Last_name'],sep = '+')

In [36]:
data

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name,State_name,Full_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,Priyang,Bhatt,New York,Priyang+Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Rashmin,Panchal,California,Rashmin+Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Anil,Rana,IL,Anil+Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Rahul,Patel,TX,Rahul+Patel

In [37]:
data

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name,State_name,Full_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,Priyang,Bhatt,New York,Priyang+Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Rashmin,Panchal,California,Rashmin+Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Anil,Rana,IL,Anil+Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Rahul,Patel,TX,Rahul+Patel

In [39]:
data['Name'].str.get(-1)

0    t
1    l
2    a
3    l
Name: Name, dtype: object

In [44]:
data['Name'].str.split().str.get(-1)

0      Bhatt
1    Panchal
2       Rana
3      Patel
Name: Name, dtype: object

In [52]:
data['Name'].str.slice(0,3)

0    Pri
1    Ras
2    Ani
3    Rah
Name: Name, dtype: object

In [54]:
data['name_state'] = data['Name'].str.slice(0,3) + ' ' + data['State']

In [55]:
data

,Name,City,State,name_lower,name_upper,Nmae_len,City_strip,First_name,Last_name,State_name,Full_name,name_state
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,Priyang,Bhatt,New York,Priyang+Bhatt,Pri NY
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Rashmin,Panchal,California,Rashmin+Panchal,Ras CA
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Anil,Rana,IL,Anil+Rana,Ani IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Rahul,Patel,TX,Rahul+Patel,Rah TX

In [57]:
data['Name'].str.find('h')

0    9
1    3
2   -1
3    2
Name: Name, dtype: int64

In [59]:
data['Name'].str.rfind('a')

0    10
1    13
2     8
3     7
Name: Name, dtype: int64